Revit 2024 API
Application.VersionBuild Property
 Returns the internal build number of the Autodesk Revit application.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public string VersionBuild { get; }
Visual Basic
Public ReadOnly Property VersionBuild As String
	Get
Visual C++
public:
property String^ VersionBuild {
	String^ get ();
}
Remarks
 This property can be used by your application to find the version of Autodesk Revit against which your application is running. Based on this information your application can report if it is able to work correctly with that version of Autodesk Revit.
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace